UR_SDESK.ТелеграмБот/src/Catalogs/тг_Объект/тг_Объект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тг_Объект</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.тг_ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Чат</name>
    <type>
      <types>CatalogRef.тг_Объект</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.тг_Объект</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UR_SDESK.ТелеграмБот/src/Enums/тг_ТипыОбъектов/тг_ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тг_ТипыОбъектов</name>
  <enumValues>
    <name>Канал</name>
  </enumValues>
  <enumValues>
    <name>Группа</name>
  </enumValues>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
  <enumValues>
    <name>Бот</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКанала</name>
  </enumValues>
</mdclass:Enum>

UR_SDESK.ТелеграмБот/src/Catalogs/тг_Объект/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	РеквизитыРодителя 	= Справочники.тг_Объект.ПолучитьРеквизиты(Родитель);
	РеквизитыОбъекта 	= Справочники.тг_Объект.ПолучитьРеквизиты(ЭтотОбъект);

	Если НЕ ЗначениеЗаполнено(Объект1С)
		И Тип = Перечисления.тг_ТипыОбъектов.Сообщение
		И Тип = РеквизитыРодителя.Тип Тогда
		
		Если Чат <> РеквизитыРодителя.Чат Тогда 
			Объект1С = РеквизитыРодителя.Объект1С;
			ЭтотОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьСообщения");
		КонецЕсли;
		
	КонецЕсли;
	
	сч = 0;
	Пока ДополнительныеРеквизиты.Количество() > сч Цикл
		СтрокаТЧ = ДополнительныеРеквизиты.Получить(сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Строка)
			И НЕ ЗначениеЗаполнено(СтрокаТЧ.Значение) Тогда
			ДополнительныеРеквизиты.Удалить(сч);
		Иначе
			сч = сч + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Тип = ПредопределенноеЗначение("Перечисление.тг_ТипыОбъектов.Сообщение") 
		И ПометкаУдаления Тогда
		тг_Сервер.УдалитьСообщение(Ссылка);
	КонецЕсли;

КонецПроцедуры
